In [1]:
# import librearies
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [2]:
def create_server_connection(host_name,user_name,user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
        host = host_name,
        user = user_name,
        password = user_password
        )
        print("MYSQL Databases connection successful")
    except Error as err:
        print(f"Error :'{err}'")
    return connection

# put our MYSQL Terminal password
pw="*******"

# Database name
db="Sales_Department"

connection= create_server_connection( "localhost",'root',pw)

MYSQL Databases connection successful

In [3]:
# create Sales_Department
def create_database(connection,query):
    cursor=connection.cursor()
    try:
        cursor.execute(query)
        print("Databases Created Successfully")
    except Error as err:
        print(f"Error :'{err}'") 
create_database_query="create database Sales_Department"
create_database(connection,create_database_query)

Databases Created Successfully

In [4]:
# connect to database
def create_database_connection(host_name,user_name,user_password,db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
        host = host_name,
        user = user_name,
        password = user_password,
        database = db_name
        )
        print("Databases connection successful")
    except Error as err:
        print(f"Error :'{err}'")
    return connection

In [5]:
# Excute SQL Queries
def execute_query(connection,query):
    cursor=connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was successfull")
    except Error as err:
        print(f"Error :'{err}'")

In [7]:
create_order_table="""
CREATE TABLE AGENTS(
AGENT_CODE VARCHAR(6) NOT NULL PRIMARY KEY,
AGENT_NAME VARCHAR(40),
WORKING_AREA VARCHAR(35), 
COMMISSION INT, 
PHONE_NO VARCHAR(15), 
COUNTRY VARCHAR(25) );
"""

# connect to the database
connection = create_database_connection("localhost","root",pw,db)
execute_query(connection,create_order_table)

Databases connection successful
Query was successfull

In [10]:
# Insert Date
data_agents="""
INSERT INTO AGENTS VALUES
('A007', 'Ramasundar', 'Bangalore', '0.15', '077-25814763', ''),
('A003', 'Alex ', 'London', '0.13', '075-12458969', ''),
('A008', 'Alford', 'New York', '0.12', '044-25874365', ''),
('A011', 'Ravi Kumar', 'Bangalore', '0.15', '077-45625874', ''),
('A010', 'Santakumar', 'Chennai', '0.14', '007-22388644', ''),
('A012', 'Lucida', 'San Jose', '0.12', '044-52981425', ''),
('A005', 'Anderson', 'Brisban', '0.13', '045-21447739', ''),
('A001', 'Subbarao', 'Bangalore', '0.14', '077-12346674', ''),
('A002', 'Mukesh', 'Mumbai', '0.11', '029-12358964', ''),
('A006', 'McDen', 'London', '0.15', '078-22255588', ''),
('A004', 'Ivan', 'Torento', '0.15', '008-22544166', ''),
('A009', 'Benjamin', 'Hampshair', '0.11', '008-22536178', '');
"""
connection= create_database_connection("localhost","root",pw,db)
execute_query(connection,data_agents)

Databases connection successful
Query was successfull

In [11]:
def read_query(connection,query):
    cursor=connection.cursor()
    result= None
    try:
        cursor.execute(query)
        result= cursor.fetchall()
        return result
    except Error as err:
        print(f"Error :'{err}'")

In [37]:
# using the select statement
q1="""
select * from agents;
"""

connection = create_database_connection("localhost","root",pw,db)
results=read_query(connection,q1)

for data in results:
    print(data)

Databases connection successful
('A001', 'Gaurav Chatterjee', 'Bangalore', 0, '077-12346674', '')
('A002', 'Mukesh', 'Mumbai', 0, '029-12358964', '')
('A003', 'Alex ', 'London', 0, '075-12458969', '')
('A004', 'Ivan', 'Torento', 0, '008-22544166', '')
('A005', 'Anderson', 'Brisban', 0, '045-21447739', '')
('A006', 'McDen', 'London', 0, '078-22255588', '')
('A007', 'Ramasundar', 'Bangalore', 0, '077-25814763', '')
('A008', 'Alford', 'New York', 0, '044-25874365', '')
('A009', 'Benjamin', 'Hampshair', 0, '008-22536178', '')
('A010', 'Santakumar', 'Chennai', 0, '007-22388644', '')
('A011', 'Ravi Kumar', 'Bangalore', 0, '077-45625874', '')

In [31]:
# using the select statement
q2="""
select agent_name,WORKING_AREA from agents;
"""

connection = create_database_connection("localhost","root",pw,db)
result=read_query(connection,q2)

for data in result:
    print(data)

Databases connection successful
('Gaurav Chatterjee', 'Bangalore')
('Mukesh', 'Mumbai')
('Alex ', 'London')
('Ivan', 'Torento')
('Anderson', 'Brisban')
('McDen', 'London')
('Ramasundar', 'Bangalore')
('Alford', 'New York')
('Benjamin', 'Hampshair')
('Santakumar', 'Chennai')
('Ravi Kumar', 'Bangalore')
('Lucida', 'San Jose')

In [17]:
# using the select statement
q3="""
select distinct WORKING_AREA from agents;
"""

connection = create_database_connection("localhost","root",pw,db)
result=read_query(connection,q3)

for data in result:
    print(data)

Databases connection successful
('Bangalore',)
('Mumbai',)
('London',)
('Torento',)
('Brisban',)
('New York',)
('Hampshair',)
('Chennai',)
('San Jose',)

In [35]:
# using the select statement
q4="""
select * from agents
where WORKING_AREA="Chennai";
"""

connection = create_database_connection("localhost","root",pw,db)
result=read_query(connection,q4)

for data in result:
    print(data)

Databases connection successful
('A010', 'Santakumar', 'Chennai', 0, '007-22388644', '')

In [19]:
# using the select statement
q7="""
select * from agents
order by agent_name;
"""
connection = create_database_connection("localhost","root",pw,db)
result=read_query(connection,q7)
for data in result:
    print(data)

Databases connection successful
('A003', 'Alex ', 'London', 0, '075-12458969', '')
('A008', 'Alford', 'New York', 0, '044-25874365', '')
('A005', 'Anderson', 'Brisban', 0, '045-21447739', '')
('A009', 'Benjamin', 'Hampshair', 0, '008-22536178', '')
('A004', 'Ivan', 'Torento', 0, '008-22544166', '')
('A012', 'Lucida', 'San Jose', 0, '044-52981425', '')
('A006', 'McDen', 'London', 0, '078-22255588', '')
('A002', 'Mukesh', 'Mumbai', 0, '029-12358964', '')
('A007', 'Ramasundar', 'Bangalore', 0, '077-25814763', '')
('A011', 'Ravi Kumar', 'Bangalore', 0, '077-45625874', '')
('A010', 'Santakumar', 'Chennai', 0, '007-22388644', '')
('A001', 'Subbarao', 'Bangalore', 0, '077-12346674', '')

In [38]:
Agents=[]
for result in results:
    result=list(result)
    Agents.append(result)
    
columns= ["AGENT_CODE","AGENT_NAME","WORKING_AREA","COMMISSION","PHONE_NO","COUNTRY"]
df=pd.DataFrame(Agents,columns=columns)
display(df)

,AGENT_CODE,AGENT_NAME,WORKING_AREA,COMMISSION,PHONE_NO,COUNTRY
0,A001,Gaurav Chatterjee,Bangalore,0,077-12346674,
1,A002,Mukesh,Mumbai,0,029-12358964,
2,A003,Alex,London,0,075-12458969,
3,A004,Ivan,Torento,0,008-22544166,
4,A005,Anderson,Brisban,0,045-21447739,
5,A006,McDen,London,0,078-22255588,
6,A007,Ramasundar,Bangalore,0,077-25814763,
7,A008,Alford,New York,0,044-25874365,
8,A009,Benjamin,Hampshair,0,008-22536178,
9,A010,Santakumar,Chennai,0,007-22388644,
10,A011,Ravi Kumar,Bangalore,0,077-45625874,

In [33]:
# Update command
update="""
update agents
set agent_name = "Gaurav Chatterjee"
where AGENT_CODE = "A001"
"""
connection = create_database_connection("localhost","root",pw,db)
execute_query(connection,update)

Databases connection successful
Query was successfull

In [34]:
# Delete command
delete_order="""
delete from agents
where AGENT_CODE = "A012"
"""
connection = create_database_connection("localhost","root",pw,db)
execute_query(connection,delete_order)

Databases connection successful
Query was successfull